### Q.5 Create a Pandas DataFrame from List of Dicts

In [1]:
import pandas as pd

In [2]:
dict1 = {
    "Name":['AB Devraj', 'Aditya ', 'Sonu', 'AB'],
    "Marks":[86,57,58,97],
    "City":['rampur', 'jaipur', 'dilli', 'mabbi'] 
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

        Name  Marks    City
0  AB Devraj     86  rampur
1    Aditya      57  jaipur
2       Sonu     58   dilli
3         AB     97   mabbi

In [10]:
data1 = [['Geeks', 5, 'For', 6, 'geeks', 7],
        ['Geeks',10, 'For', 20, 'geeks', 30]]

In [12]:
pd.DataFrame(data1)

       0   1    2   3      4   5
0  Geeks   5  For   6  geeks   7
1  Geeks  10  For  20  geeks  30

In [14]:
data = [{'Geeks': [1,2,3], 'For': 'using', 'geeks': 'list'},
        {'Geeks':10, 'For': 20, 'geeks': 30}] 
    
# Creates DataFrame. 
df = pd.DataFrame(data) 
    
# Print the data 
df

       Geeks    For geeks
0  [1, 2, 3]  using  list
1         10     20    30